# Найдите сумму цифр трехзначного числа.
# Пример:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

a=int(input("Введите трехзначное число: "))
if a>=100 and a<1000:
    # 123=3 2 1
    b=a%10
    # print(b)
    a=(a-b)//10
    # print(a,b)
    c=a%10
    # print(b,c)
    d=a//10
    # print(b,c,d)
    resalt=b+c+d
    print(f"Cуммa цифр трехзначного числа: {resalt}")
else: print("Число введено некорректно")